# coding: utf-8
import sys


KIANA_LINES = [

# 出击
"琪亚娜，出击！",
"终于轮到我了么！",

# 战斗
"呦吼",
"这里可是我的出场哦",
"哼(｡•ˇ‸ˇ•｡)绝不会让你能靠近芽衣半步",
"收到收到",
"突然好想吃美少女味的泡面呐",
"现在是琪亚娜时间",
"哼，惹到我可是很危险的",
"别小看我",
"嘛，你就是舰长呢，好好努力吧！",
"别跟我提任务好好努力吧！",
"芽衣会讨厌我，一定是奇异点产生的影响！",
"本小姐才不喜欢这些臭钱呢！",
"为什么要治疗？我要喝芽衣的妹汁！",
"谁知道又是什么破玩意",
"这里可是我的主场",
"这么简单的任务就不要叫我了嘛",
"不要跟我提任务，吃饱了睡饱觉才能拯救世界",
"不对不对，我的剧本不是这么写的！",
"因为我就是琪亚娜.卡斯兰娜",
"showtime",
"ready your weapon",
"neko charge",
"gungnir fire",
"gungnir explosion",
"nako nako",

# 一星好感度
"wai，你是要作死么！？",
"哎呀！走开啦！",
"哎！去死！（｀Δ´）！",

# 二星好感度
"好烦啊，把手拿开！",
"干什么啊，真是的…",
"干嘛啊",
"哎！你想被揍扁么！",
"碰我干嘛？讨厌！",
"去死去死去死…",
"变态变态变态…",
"wai，我可是会咬人的",

# 三星好感度
"芽衣说了，被摸头会长不高的！",
"咦丫！",
"嗨呀，会痒的啦！走开啦！",
"不可以，不可以，哪里不可以的啦！",
"舰长的手又开始不听指挥了么？",
"舰 舰长 真是不能给你一点好脸色！哼！",
"啊！真不要脸，住手啦！",
"你在做什么丫，哼！",

# 四星好感度
"嗨呀，真是 你呀…算了…",
"哼哼哼，走开痒死人家了",
"嗯…别以为人家不知道你在想着什么",
"咿呀！不要用这种眼神看着人家啦",
"舰长！不是说了要看好时间和场合的嘛，哼！",
"舰长！你这样还怎么指挥战斗真是不靠谱呢",
"哎，舰 舰长要不明天的任务就交给别人吧！",
"你呀，又想要对我做什么了",
"舰长其实我也不是那么讨厌你啦，偶尔听听命令也不是不可以的，哎，才 才 才不是那个意思，哼！",


# 换装
"嗯，这衣服有好几件一模一样的",
"不知道这个颜色芽衣喜不喜欢呢？",
"舰长！你让我穿成这样去战斗 才 才没有",
"担心会弄脏呢！",
"哼哼，今天如果有人敢弄脏我的衣服，那他就死定了！",

]

MEI_LINES = [

# 战斗
"呦西",
"话说舰长你真的不认为这次崩坏是受水星逆行的影响吗？",
"总觉的有点隐隐不安呢",
"烦死了，家里还有两个吃闲饭的等着我回去做早餐呢",
"舰长下一个目标是什么？",
"兵不厌诈",
"这里可不能退让",
"轮到我了",
"看来这次要使出全力了",
"果然这就是天命吗？",
"怎么没看到琪亚娜那家伙，不会又到哪去偷懒了吧？",
"比我想的要简单嘛，看来是我多虑了",
"舰长你发现我受伤了，谢谢关心呢",
"为什么收集金币也是女武神的任务",
"这样子对待女孩子可是很没修养的哦！",
"让我把你们的罪孽加倍奉还！",
"你就是我的舰长嘛？",
"这一次不会放过他们了！",
"这一次不会对敌人温柔了！",
"女武神芽衣参上！",
"要进行作战会议了么？",
"这次得到的是什么装备跟期待呢！",
"Yes'commander",
"影分身，瞬！",
"Lighting turn",

# 一星好感度
"舰长有什么事么？",
"唉！啊！",
"对 对 对不起一紧张就激发了十万伏高压呢！",
"舰长有什么问题么？",
"不要啦！",
"舰长你怎么了？",
"哎，怎么了？",

# 二星好感度
"难道说在舰长的眼里芽衣就是小孩子嘛？",
"唉！嘿！舰 舰 舰长",
"讨厌我可要生气啦！",
"舰长会痒的啦！",
"舰长你这样做芽衣有些在意呢",
"咳咳，舰长",

# 三星好感度
"感觉又充满力量了呢，舰长",
"舰，舰长~",
"不 不要这样啦！",
"舰长，会 会被人看到的啦！",
"嗯，腰痛好多啦！舰长你还是先把报告看完吧！",
"不～要～这样啦（*/∇＼*）",
"舰长会被人看到的啦！",
"舰长要不要一起喝点茶呢？",

# 四星好感度
"芽衣已经休息好了，舰长请不要担心啦！",
"和舰长一起看舰桥外的浮云芽衣最喜欢了",
"哎！哪里 好吧",
"嘿嘿，舰长真是温柔，对芽衣这么在意呢",
"舰长原来也有这么温柔的一面呢",
"舰长，芽衣从来没有被这么对待过，芽衣感觉好温暖呢",
"舰长你会不会对别人也做这样的事情呢？芽衣有些在意呢",
"舰长这么温柔的对待芽衣要怎么来回报呢",
"如果可以芽衣想要一直陪着舰长",


# 换装
"这套衣服很符合今天的心情",
"今天又该提醒琪亚娜洗衣服了",
"舰长还真是了解芽衣的喜好呢，非常合身哦！",
]

BRONYA_LINES = [
# 出击

"重装小兔19c现在可不是瞌睡的时候啦",
"除了战斗之外bronya一无所有",
"bronya",
"重装小兔19c up'grade",

# 战斗
"cosmos'break",
"Valkyrie'system启动",
"target'locked",
"任务队列为空，bronya进入警戒状态",
"bronya到达配置地点",
"暂时无需生命回复",
"Yes'master",
"fired",
"bronya遵命",
"无条件射杀请求，批准",
"发现敌方单位",
"Shooting",
"终结技能冷却完成",
"火控系统激活确认",
"金币回收作业完毕",
"装备回收作业完毕",
"系统警告战局危险指数升高",
"任务完成，系统进入待机模式",
"系统警告敌我战力存在异差",
"任务失败了",
"系统警告第一级战斗配置",
"虚空，爆裂",
"敌方目标全体歼灭，bronya请求回收",
"舰长请传送下一行动坐标",
"最佳作战时间",
"终结技能解禁",
"生命回复作业完毕",

# 一星好感度
"发现不明物体，雷达检测全开",
"检测到潜在威胁，进入警戒态式重装小兔19c核心身体部位检测到不明入侵",
"重装小兔19c fired！",
"糟糕，敌人居然找到了重装小兔的防御盲点",
"嗯？又检测到一只危险的家伙",
"全副领域检测开启",
"危险的家伙不要靠近我",

# 二星好感度
"这里是bronya的神经中枢，禁止随意触摸",
"检测到恶意行为好感度降低",
"舰长不要以为禁止使用重装小兔bronya就没有别的攻击手段了",
"中枢电脑root权限已获得，即将向全舰直播舰长的行为",
"bronya无法解析舰长的行为",
"已加强该区域的防御不会给敌人第二次的机会的",
"bronya收到不明行动指示",

# 三星好感度
"舰长体温36.8℃，超出标准0.1℃，处于正常体温范畴",
"防御系统已对舰长进行友方识别，舰长不会受到攻击",
"HB3074号档案显示，摸头是表示安慰丶鼓励丶或疼爱的含蓄表达那么舰长想表达的是什么呢？",
"检测到异常神经波形，似乎代表了一种未知的感情变化",
"舰长，bronya现在应该做些什么？",
"舰长bronya检测到机体温度上升中",

# 四星好感度
"妈妈，为什么bronya会想到妈妈呢？",
"舰长，bronya此刻不知道该用什么表情来表达",
"舰长，不明原因导致bronya的机体温度在上升中",
"舰长，再这样下去bronya的神经中枢会坏掉的",
"bronya的防御机制将对舰长永久解除",
"看样子重装小兔19c也很喜欢舰长呢",
"舰长你是想要bronya脱掉腿部的强制装甲么？",

# 换装

"重装小兔说它也很喜欢这套衣服呢",
"衣服只是各种材料做的遮挡物摆了，bronya不在意",
"系统没有告诉bronya为什么要换衣服呢",

]
SAKURA_LINES = [

# 出击
"八重樱请求出击",
"舰长遵从你的命令",
"是有任务要交给我么？",
"已经很久没有出场了呢",

# 战斗
"不会让你失望的",
"确认指令，前往目标区域！",
"敌暗我明",
"意外收入啊！",
"总觉的睡不醒呢",
"还不错",
"发现你们了",
"很轻松的任务",
"总是让女武神冲锋在前的舰长可不是好舰长哦！",
"就这样静静的休息很不错呢",
"不打算前进了么？",
"确认指令!通向黄泉的道路已经为你们打开了",
"哈~感觉好多啦",
"有点浪费呢",
"今天的天气非常适合战斗呢！",
"这一切 分出胜负吧！",
"敌人的气势变强了！",
"消失吧！",
"封印解除！",
"樱花·散！",


# 一星好感度

"新加入的女武神八重樱请阁下多多关照",
"啊！你！你！˚‧º·(˚ ˃̣̣̥᷄⌓˂̣̣̥᷅ )‧º·˚",
"嗯，身体不自觉的就动了起来",
"我正在为下一场战斗做准备呢",
"哈啊！请不要做这种过分的事情！",
"无论是做剑士还是巫女个子都不能太高",
"讨厌的家伙就切碎吧",
"兴农的春野已经开满樱花了吧",
"请不要胡闹了",
"请不要做这种过份是事情",

# 二星好感度

"我为舰长准备了饭团，要吃吗？",
"哈啊！舰长！",
"舰长补给全保底，舰长副本零掉落",
"这是注连绳，据说有分割两界的强大发力",
"再这样休怪我无礼了！",
"舰长我刚刚领悟力一式剑术，请多多指教",
"没想到醒来时已是五百年之后了",
"如此温柔的抚摸让我想起了卡莲",
"这个身体似乎不会老去，但我想见的人却都离去了",


# 三星好感度

"舰长，我可是五百多岁喽",
"对不起，我的心已经属于卡莲了",
"舰长我刚才看到你对芽衣也这么做了喽",
"咦？舰长这么喜欢我做的饭团么",
"剑术，那确实是巫女的基本功课之一呢",
"啊哈～请不要碰这里",
"舰长…作为指挥官还是多想想作战计划之类的吧",
"舰长我听说他们在议论什么非洲人，欧洲人那都是什么意思啊",
"舰长真是越来越大胆了呢",


# 四星好感度
"舰长，我的狐狸耳朵喜欢么？",
"我一定要保护的人又多了一个呢",
"舰长喜欢樱花么？明年的春天一起去赏樱吧",
"我之前好像做了个很长很长的梦呢",
"你的手感觉特别的温暖呢！",
"这个身体一直不会老去",
"舰长你愿意在以后的日子里一直陪着我么？",
"舰长清一直陪着我，好么？",
"舰长，我们…我们还是先说说工作的事情吧",
"似乎要融化在舰长的温柔之中了",

]

HIMEKO_LINES = [
# 出击
"谁在呼叫舰队？",
"话说休伯利安本来的舰长可是我呦",
"女武神姬子等候你的命令",

# 战斗
"吼，作战已经开始了么？",
"正在向目标移动",
"要照顾一群小女孩，舰长你也是够辛苦的",
"没有敌人出现就不要叫醒我",
"这次的对手是布满触手和粘液的家伙么？",
"我看好你呦舰长！",
"我可是欧洲人！",
"正在向敌人移动",
"只有这样的小角色么？",
"可恶",
"都藏到哪去了？",
"也就一般般吧",
"补给来的很及时嘛",
"快点解决掉把",
"哼，让我给你们一个深刻的教训吧！",
"哼，颤抖吧！",
"找到理想的对象前我可不会死",
"会不会营养过剩呢",
"胜利女神正在朝你微笑哦",
"看来这次是中头彩了！",
"预料之外的结果",
"乱刃.龙卷",

# 一星好感度
"哼，看来你还要再长高一点",
"我对小男生可没什么兴趣",
"wai，这样感觉会不舒服的",
"ben",
"舰长的好奇心还真强呐",
"现在是工作时间，舰长你还是正经一点吧",
"舰长看起来并不怎么忙嘛",
"舰长你已经准备好去死了，是么？",

# 二星好感度
"wai，你牵过女孩子的手嘛？",
"啊，真是拿你没办法",
"你的手放在哪里了！",
"我说舰长，不可以再这样喽！知道了么？嗯？",
"wai，不许随便碰我的脸！知道没有？",
"wai，舰长你对女孩子这么粗鲁可不行！",
"可恶，舰长你是想被修理一下么？嗯？",
"嗯！！舰长你在做什么？",
"看来我待好好教训你一下了",

# 三星好感度
"嗯～舰长的动作可是会让我误会的哦",
"舰长你是在找这个么？",
"舰长你又乱来了！",
"舰长你是不是想要对我做点什么？",
"你是想要我这样么？",
"总觉得最近胖了一点",
"嗯～又困又累，舰长说好去夏威夷度假的呢？",
"舰长这个动作可不适合你",
"你是喜欢这里呢？还是这里？",

# 四星好感度
"哼哼，这是大人的吻呦",
"舰长你到底喜欢我的哪里呢？",
"嗯~舰长真像个没长大的孩子，要不要再来个鼓励的抱抱？",
"肌肉是不是太发达了点？摸着都没有女孩子的柔软感了吧",
"你可以把头枕在这里，或是说你想休息一下的话",
"舰长毕竟是工作时间，你可不可以稍微正经一点阿",
"nonono我们还没有正式约会过呢",
"舰长你以前不是说你喜欢娇小的类型么",


# 换装

"吼 今天是这个颜色还不赖嘛！",
"成熟女性可不会因为一件漂亮衣服就被收买哦！",
"嗨 女武神的服装为什么不能再大胆一点呢",

]

LINES = {
    'kiana' : KIANA_LINES,
    'mei' : MEI_LINES,
    'bronya' : BRONYA_LINES,
    'sakura' : SAKURA_LINES,
    'himeko': HIMEKO_LINES,
}



class ValkyrieLines(object):
    def __init__(self):
        self.data = LINES

    def get_lines(self, avator_name):
        lines = self.data.get(avator_name, [])
        if sys.version_info < (3, 0):
            lines = [w.decode('utf-8') for w in lines]
        return lines

linesGetter = ValkyrieLines()
